#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.app_service_roles.module.apim.data.azurerm_api_management.this["dx-d-itn-test-rg-01|dx-d-itn-playground-pg-apim-01"]: Still reading... [10s elapsed]
module.app_service_roles.module.apim.data.azurerm_api_management.this["dx-d-itn-test-rg-01|dx-d-itn-playground-pg-apim-01"]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_monitor_diagnostic_setting.logs["cosmos-account"] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "logs" {
        id                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/dx-d-itn-playground-pg-cosno-01|cosmos-account-diagnostic-settings"
        name                           = "cosmos-account-diagnostic-settings"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "Requests" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "SLI" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }

        # (3 unchanged blocks hidden)
    }

  # module.function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "DT_CLUSTER_ID"                                   = "@Microsoft.KeyVault(SecretUri=https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-cluster-id)"
          + "DT_CONNECTION_AUTH_TOKEN"                        = "@Microsoft.KeyVault(SecretUri=https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-connection-auth-token)"
          + "DT_CONNECTION_BASE_URL"                          = "@Microsoft.KeyVault(SecretUri=https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-target-url)"
          + "DT_TENANT"                                       = "@Microsoft.KeyVault(SecretUri=https://dx-d-itn-common-kv-01.vault.azure.net/secrets/dynatrace-tenant)"
            # (8 unchanged elements hidden)
        }
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        name                                           = "dx-d-itn-playground-be-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS700 - ENGINEERING"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_test_durable.azurerm_role_assignment.durable_function_storage_blob_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "durable_function_storage_blob_data_contributor" {
      + description                      = "Allow Function App to manage blobs in the Durable Function storage account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfd01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_role_assignment.durable_function_storage_queue_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "durable_function_storage_queue_data_contributor" {
      + description                      = "Allow Function App to manage queues in the Durable Function storage account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfd01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_role_assignment.durable_function_storage_table_data_contributor[0] will be created
  + resource "azurerm_role_assignment" "durable_function_storage_table_data_contributor" {
      + description                      = "Allow Function App to manage tables in the Durable Function storage account"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Table Data Contributor"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfd01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2703c6c3-b828-4318-8d96-b0b5aaa2f312"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygrounddfstfn01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_test_durable.azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                               = [
          ~ "10.50.7.0/24" -> "10.50.8.0/24",
        ]
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-df-func-snet-01"
        name                                           = "dx-d-itn-playground-df-func-snet-01"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{to-do-api-function-key}}</value>
          - 		</set-header>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <set-header name="x-functions-key" exists-action="override">
          +       <value>{{to-do-api-function-key}}</value>
          +     </set-header>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

Plan: 6 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_cosmosdb_sql_container.tasks,
  on cosmos.tf line 37, in resource "azurerm_cosmosdb_sql_container" "tasks":
  37:   partition_key_path    = "/id"

`partition_key_path` will be removed in favour of the property
`partition_key_paths` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
